
## Plan Result

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5707141355)


<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.ecs.aws_cloudwatch_log_group.cloudwatch_log_group
  * module.ecs.aws_ecs_cluster.ecs_cluster
  * module.ecs.aws_ecs_service.ecs_service
  * module.ecs.aws_ecs_task_definition.ecs_task_definition
  * module.ecs.module.ecs_task_execution_role.aws_iam_policy.main
  * module.ecs.module.ecs_task_execution_role.aws_iam_role.main
  * module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.main


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ecs.aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "bined-hasura"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.ecs.aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "bined-hasura"
      + tags_all = (known after apply)
    }

  # module.ecs.aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bined-hasura"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bined-hasura"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/bined-hasura-alb-target-group/dd6db5e43b282fe2"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0ff51e5c4d89f1d35",
            ]
          + subnets          = [
              + "subnet-04e257e755c87b631",
              + "subnet-0f0bc25f4fe692b9f",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu    = 256
                  + memory = 512
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "bined-hasura"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.ecs.module.ecs_task_execution_role.aws_iam_policy.main will be created
  + resource "aws_iam_policy" "main" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "ecs-task-execution-role-name-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::110728338021:role/ecsTaskExecutionRole"
                    },
                  + {
                      + Action   = "ecs:ExecuteCommand"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::110728338021:role/ecsTaskExecutionRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ecs.module.ecs_task_execution_role.aws_iam_role.main will be created
  + resource "aws_iam_role" "main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-execution-role-name-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.main will be created
  + resource "aws_iam_role_policy_attachment" "main" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs-task-execution-role-name-dev"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":11,"Program":"tfcmt","SHA1":"e30bd660ca962b7ce818e85b4401e304acf32bfa","Vars":{},"WorkflowName":"Terraform"} -->